var rp = require('request-promise');
var fs = require('fs');
var mkdir = require('mkdirp');

var preUrl = 'http://xscj.hit.edu.cn/hitjwgl/XS/XSZP/ZP1';
var grade = ['13'];
var depart = ['031'];
//var grade = ['13', '14'];
//var depart = ['001', '010', '011', '012', '013', '020', '021', '022', '023', '024', '025', '030', '031', '032', '033', '034', '040', '041', '042', '050', '051', '052', '053', '054', '055', '059', '05A', '05X', '05Y', '061', '062', '070', '073', '074', '075', '080', '081', '082', '083', '084', '085', '091', '100', '101', '102', '10A', '110', '111', '112', '113', '8', '120', '121', '122', '123', '131', '13A', '13Z', '141', '142', '143', '144', '145', '151', '152', '153', '157', '158', '159', '161', '163', '168', '169', '180', '181', '182', '183', '184', '185', '190', '19A', '200', '201', '202', '203', '204', '205', '20A', '20B', '20C', '20D', '20E', '210', '211', '212', '213', '21X', '220', '221', '222', '22A', '22B', '231', '232', '238', '239', '242', '250', '251', '261', '262', '270', '271', '272', '280', '280', '281', '282', '28A', '28B', '290', '291', '292', '300', '301', '302', '303', '304', '30X', '30Y', '320', '321', '322', '323', '324', '325', '330', '331', '332', '333', '334', '339', '340', '341', '342', '343', '344', '345', '346', '347', '34A', '351', '360', '361', '371', '372', '373', '379', '381', '382', '391', '400', '411', '421', '441', '442', '450', '451', '452', '461', '501'];

console.log("BUG无数，耐心等待，别乱动窗口，防止卡死。。。。。。。。。下载的太多可能很慢很慢很慢。。。。建议尽量减小depart与grade的数组大小");

var dir = './images';

mkdir(dir, function(err) {
    if(err) {
        console.log(err);
    }
});

function sleep(milliSeconds) {
    var startTime = new Date().getTime();
    while (new Date().getTime() < startTime + milliSeconds);
};
 

function downloadImage() {
    for(var i = 0; i < grade.length; i++) {
        for(var j = 0; j < depart.length; j++) {
            for(var k = 1; k <= 7; k++) {
                for(var  p = 1; p <= 30; p++) {
                    if(p < 10) {
                        p = '0' + p;
                    }
                    trueUrl = preUrl + grade[i] + '/1' + grade[i] + depart[j] + 0 + k + p + '.jpg';
                    name = grade[i] + depart[j] + 0 + k + p + '.jpg';
                    rp(trueUrl).pipe(fs.createWriteStream(dir + '/' + name));
                }
            }
        }
    }
}

downloadImage();